ДО_для_разработки/src/InformationRegisters/ЖурналСобытийЭД/ЖурналСобытийЭД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЖурналСобытийЭД</name>
  <resources>
    <name>ВладелецЭД</name>
    <type>
      <types>DefinedType.ОснованияЭлектронныхДокументов</types>
    </type>
  </resources>
  <resources>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>СтатусЭД</name>
    <type>
      <types>EnumRef.СтатусыЭД</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьСтатусЭД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ПрисоединенныйФайл</name>
    <type>
      <types>CatalogRef.ЭДПрисоединенныеФайлы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерЗаписи</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ДО_для_разработки/src/Enums/СтатусыЭД/СтатусыЭД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыЭД</name>
  <enumValues>
    <name>Аннулирован</name>
  </enumValues>
  <enumValues>
    <name>Доставлен</name>
  </enumValues>
  <enumValues>
    <name>ДоставленоПодтверждение</name>
  </enumValues>
  <enumValues>
    <name>НеПолучен</name>
  </enumValues>
  <enumValues>
    <name>НеСформирован</name>
  </enumValues>
  <enumValues>
    <name>Обработан</name>
  </enumValues>
  <enumValues>
    <name>Отклонен</name>
  </enumValues>
  <enumValues>
    <name>ОтклоненПолучателем</name>
  </enumValues>
  <enumValues>
    <name>Отправлен</name>
  </enumValues>
  <enumValues>
    <name>ОтправленоИзвещение</name>
  </enumValues>
  <enumValues>
    <name>ОтправленоПодтверждение</name>
  </enumValues>
  <enumValues>
    <name>ОтправленоПредложениеОбАннулировании</name>
  </enumValues>
  <enumValues>
    <name>ОтправленоУведомление</name>
  </enumValues>
  <enumValues>
    <name>ОшибкаПередачи</name>
  </enumValues>
  <enumValues>
    <name>ПереданОператору</name>
  </enumValues>
  <enumValues>
    <name>ПодготовленКОтправке</name>
  </enumValues>
  <enumValues>
    <name>ПодготовленоИзвещение</name>
  </enumValues>
  <enumValues>
    <name>ПодготовленоПодтверждение</name>
  </enumValues>
  <enumValues>
    <name>Подписан</name>
  </enumValues>
  <enumValues>
    <name>ПолностьюПодписан</name>
  </enumValues>
  <enumValues>
    <name>Получен</name>
  </enumValues>
  <enumValues>
    <name>ПолученоИзвещение</name>
  </enumValues>
  <enumValues>
    <name>ПолученоПодтверждение</name>
  </enumValues>
  <enumValues>
    <name>ПолученоПодтверждениеОператора</name>
  </enumValues>
  <enumValues>
    <name>ПолученоПредложениеОбАннулировании</name>
  </enumValues>
  <enumValues>
    <name>ПолученоУведомление</name>
  </enumValues>
  <enumValues>
    <name>Принят</name>
  </enumValues>
  <enumValues>
    <name>Сформирован</name>
  </enumValues>
  <enumValues>
    <name>СформированоПредложениеОбАннулировании</name>
  </enumValues>
  <enumValues>
    <name>УдалитьИсполнен</name>
  </enumValues>
  <enumValues>
    <name>УдалитьКартотека2</name>
  </enumValues>
  <enumValues>
    <name>УдалитьНеОтправлен</name>
  </enumValues>
  <enumValues>
    <name>УдалитьОтказанАБС</name>
  </enumValues>
  <enumValues>
    <name>УдалитьОтклоненБанком</name>
  </enumValues>
  <enumValues>
    <name>УдалитьОшибкаРеквизитов</name>
  </enumValues>
  <enumValues>
    <name>УдалитьПодтвержден</name>
  </enumValues>
  <enumValues>
    <name>УдалитьПриостановлен</name>
  </enumValues>
  <enumValues>
    <name>УдалитьЭПНеВерна</name>
  </enumValues>
  <enumValues>
    <name>Утвержден</name>
  </enumValues>
  <enumValues>
    <name>ЧастичноПодписан</name>
  </enumValues>
</mdclass:Enum>

ДО_для_разработки/src/InformationRegisters/ЖурналСобытийЭД/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

////////////////////////////////////////////////////////////////////////////////
// Обновление информационной базы

// Обработчик обновления БЭД 1.1.3.7
// Изменился тип реквизита СтатусЭД в РС ЖурналСобытийЭД со строки на ПеречислениеСсылка.
Процедура ОбновитьСтатусыЭД() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЖурналСобытийЭД.УдалитьСтатусЭД,
	|	ЖурналСобытийЭД.ПрисоединенныйФайл,
	|	ЖурналСобытийЭД.НомерЗаписи
	|ИЗ
	|	РегистрСведений.ЖурналСобытийЭД КАК ЖурналСобытийЭД
	|ГДЕ
	|	ЖурналСобытийЭД.УдалитьСтатусЭД <> """"";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.УдалитьСтатусЭД = НСтр("ru = 'Доставлен получателю'") Тогда
			УдалитьСтатусЭД = Перечисления.СтатусыЭД.Доставлен;
		ИначеЕсли Выборка.УдалитьСтатусЭД = НСтр("ru = '<Не получен>'") Тогда
			УдалитьСтатусЭД = Перечисления.СтатусыЭД.НеПолучен;
		ИначеЕсли Выборка.УдалитьСтатусЭД = НСтр("ru = '<Не сформирован>'") Тогда
			УдалитьСтатусЭД = Перечисления.СтатусыЭД.НеСформирован;
		ИначеЕсли Выборка.УдалитьСтатусЭД = НСтр("ru = 'Отправлен получателю'") Тогда
			УдалитьСтатусЭД = Перечисления.СтатусыЭД.Отправлен;
		ИначеЕсли Выборка.УдалитьСтатусЭД = НСтр("ru = 'Отправлено уведомление об уточнении'") Тогда
			УдалитьСтатусЭД = Перечисления.СтатусыЭД.ОтправленоУведомление;
		ИначеЕсли Выборка.УдалитьСтатусЭД = НСтр("ru = 'Отправлен оператору ЭДО'") Тогда
			УдалитьСтатусЭД = Перечисления.СтатусыЭД.ПереданОператору;
		ИначеЕсли Выборка.УдалитьСтатусЭД = НСтр("ru = 'Получено уведомление об уточнении'") Тогда
			УдалитьСтатусЭД = Перечисления.СтатусыЭД.ПолученоУведомление;
		Иначе
			УдалитьСтатусЭД = СтрЗаменить(Выборка.УдалитьСтатусЭД, " ", "");
			УдалитьСтатусЭД = Перечисления.СтатусыЭД[УдалитьСтатусЭД];
		КонецЕсли;
		
		НаборЗаписей = РегистрыСведений.ЖурналСобытийЭД.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ПрисоединенныйФайл.Установить(Выборка.ПрисоединенныйФайл);
		НаборЗаписей.Отбор.НомерЗаписи.Установить(Выборка.НомерЗаписи);
		НаборЗаписей.Прочитать();
		Для Каждого Запись Из НаборЗаписей Цикл
			Запись.СтатусЭД = УдалитьСтатусЭД;
		КонецЦикла;
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(НаборЗаписей);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
